'use client';

import Image from 'next/image';

export default function HomePage() {
  const termsContent = [
    {
      title: 'پذیرش شرایط',
      content:
        'با دسترسی به یا استفاده از پلتفرم، شما تأیید می‌کنید که این شرایط و همچنین سیاست حفظ حریم خصوصی ما را مطالعه و با آن موافقت کرده‌اید. شما همچنین اعلام می‌دارید که حداقل ۱۸ سال سن دارید یا به سن قانونی در حوزه قضایی خود رسیده‌اید و توانایی حقوقی برای انعقاد این توافق را دارید. در صورتی که به نمایندگی از یک سازمان از پلتفرم استفاده می‌کنید، تأیید می‌نمایید که اختیار لازم برای الزام آن سازمان به این شرایط را دارید. ما حق داریم در هر زمان این شرایط را تغییر دهیم و این تغییرات پس از انتشار در پلتفرم اجرایی خواهند شد. استفاده ادامه‌دار شما به منزله پذیرش شرایط به‌روز شده است.',
    },
    {
      title: 'شرح خدمات',
      content:
        'سایا یک پلتفرم مبتنی بر وب برای طراحی، انتشار و توزیع نظرسنجی‌ها، فرم‌ها، آزمون‌ها و ابزارهای مشابه است. همچنین امکان جمع‌آوری پاسخ‌ها، تحلیل داده‌ها و تهیه گزارش نیز در آن فراهم است. برخی خدمات رایگان هستند و برخی دیگر نیازمند پرداخت یا اشتراک می‌باشند. ما تلاش می‌کنیم پلتفرمی امن، در دسترس و کاربرپسند ارائه دهیم اما عملکرد بدون نقص یا دائمی را تضمین نمی‌کنیم. عملکرد مستمر ممکن است بنا به دلایل فنی پیش‌بینی شده یا پیش‌بینی نشده بعضا با تداخل همراه باشد. همچنین ممکن است ویژگی‌هایی را با یا بدون اطلاع قبلی تغییر دهیم.',
    },
    {
      title: 'حساب کاربری و مسئولیت‌ها',
      content:
        'برای استفاده از امکانات پلتفرم لازم است که یک حساب کاربری در ام‌رسالت ایجاد و از طریق آن به پلتفرم وارد شوید. لازم به ذکر است که شما مسئول حفظ محرمانگی اطلاعات حساب خود هستید. اشتراک‌گذاری حساب یا دسترسی دادن به اشخاص ثالث ممنوع و مسئولیت به اشتراک‌گذاری آن متوجه خود شما است.',
    },
    {
      title: 'محتوای کاربران و مالکیت معنوی',
      content:
        "شما می‌توانید انواعی از فرم‌های ارزیابی مانند نظرسنجی، پرسشنامه، آزمون و غیره را که از این پس 'فرم' نامیده می‌شود، در سایا ایجاد و منتشر کنید. مالکیت فرم برای شما محفوظ است و هیچ شخص دیگری حق استفاده از فرم شما را به منظور جمع‌آوری داده نخواهد داشت. با این حال شما با استفاده از پلتفرم سایا، اجازه میزبانی فرم را به سایا می‌دهید و در ازای آن می‌پذیرید که هزینه خدمات سایا را پرداخت کنید. در ضمن شما تضمین می‌کنید که محتوای شما مالکیت معنوی دیگران را نقض نمی‌کند و با قوانین و مقررات سایا مطابقت دارد. در غیر این صورت ممکن است محتوای ناقض شرایط استفاده به حالت تعلیق درآید.",
    },
    {
      title: 'محتوای نامناسب و رفتارهای ممنوع',
      content:
        'شما موافقت می‌کنید که هیچ‌گونه از انواع محتوای زیر را منتشر نکنید:\n\nمحتوای غیرقانونی: نقض قوانین محلی، ملی یا بین‌المللی.\nمحتوای توهین‌آمیز: از جمله افترا، پورنوگرافی، نفرت‌پراکنی، تبعیض، یا حمله به افراد بر اساس نژاد، مذهب، جنسیت، گرایش جنسی و غیره.\nاسپم: محتوای تکراری یا بدون رضایت گیرنده.\nمحتوای مخرب: شامل ویروس یا بدافزار.\nمحتوای تجاوز به حریم خصوصی: مانند جمع‌آوری یا افشای اطلاعات شخصی بدون اجازه.\nمحتوای گمراه‌کننده یا متقلبانه.\nهمچنین هرگونه تلاش برای هک، تخریب سیستم یا استفاده از ربات برای استخراج داده ممنوع است. نقض این بند ممکن است منجر به حذف محتوا، مسدودی یا پیگرد قانونی گردد.',
    },
    {
      title: 'اشتراک‌ها و پرداخت‌ها',
      content:
        'برخی خدمات نیازمند پرداخت هستند. با خرید اشتراک، شما با پرداخت هزینه‌های مشخص‌شده موافقت می‌کنید. این هزینه‌ها قابل‌استرداد نیستند، مگر در مواردی خاص. در صورت تغییر قیمت، این تغییر در دوره بعدی اعمال می‌شود. شما موظف به به‌روز نگه‌داشتن اطلاعات پرداخت خود هستید.',
    },
    {
      title: 'سلب مسئولیت و تعلیق محتوا',
      content:
        "۷.۱ سلب مسئولیت عمومی: پلتفرم به‌صورت 'همان‌گونه که هست' ارائه می‌شود و هیچ تضمینی بابت عملکرد بی‌نقص، ایمنی کامل یا صحت نتایج وجود ندارد. مسئولیت استفاده از پلتفرم به عهده خود کاربر است.\n۷.۲ تعلیق محتوا: در صورت تشخیص محتوای نامناسب (مطابق بند ۵)، ما حق حذف یا تعلیق آن را بدون اطلاع قبلی داریم. کاربر منتشرکننده مسئول هرگونه عواقب قانونی ناشی از محتوا خواهد باشد.",
    },
    {
      title: 'حقوق مالکیت معنوی',
      content: 'تمام محتوا، نرم‌افزار، طراحی، لوگو و برندهای موجود در پلتفرم متعلق به سایا و زیست بوم ام رسالت است و مشمول قوانین مالکیت فکری است. هیچ‌گونه کپی، تغییر یا بازنشر مجاز نیست.',
    },
    {
      title: 'خاتمه یا تعلیق حساب',
      content: 'ممکن است به دلایلی همچون نقض شرایط یا فعالیت مشکوک، حساب کاربری شما در سایا محدود یا مسدود شود. این به منزله محدودیت یا مسدودی حساب کاربری شما در ام رسالت نیست.',
    },
    {
      title: 'جبران خسارت',
      content:
        'شما موافقت می‌کنید که در صورت نقض این شرایط یا قوانین، یا انتشار محتوای نامناسب یا جمع‌آوری داده به‌صورت غیرقانونی، از ما و کارکنان ما در برابر هرگونه ادعا، زیان، هزینه و خسارت مالی دفاع کرده و ما را بی‌ضرر نگه‌دارید.',
    },
    {
      title: 'اختلالات خدمات و نگهداری',
      content:
        'پلتفرم سایا ممکن است به دلایلی از قبیل نگهداری یا مشکلات فنی گاهی اوقات از دسترس خارج شود. ما تلاش می‌کنیم تا کاربران را از طریق صفحات بیرونی سامانه مطلع کنیم. با این حال سایا مسئولیتی را در قبال به تعویق افتادن انتشار فرم‌ها یا جمع‌آوری داده که در نتیجه عدم دسترسی‌های اجتناب‌ناپذیر ایجاد می‌شود، نمی‌پذیرد.',
    },
    {
      title: 'خدمات و پیوندهای شخص ثالث',
      content:
        'ممکن است فرم‌ها در پیوندهای شخص ثالث منتشر و در ازای شرکت در فرم‌ها، طبق یک قرارداد مابین سازنده فرم و شرکت‌کنندگان احتمالی، تقاضای پرداخت هزینه شود. سایا مسئولیت تبعات هرگونه پرداخت خارج از چارچوب پلتفرم را از خود سلب می‌کند.',
    },
    {
      title: 'اطلاعات تماس',
      content: 'در صورت وجود هرگونه سؤال، مشکل یا شکایت، از طریق صفحه ارتباط با ما، با کارشناسان ما تماس بگیرید.',
    },
    {
      title: 'سایر موارد',
      content: 'شرایط فوق، توافقی بین شما و سایا است. در صورت بی‌اعتباری بخشی از این شرایط، سایر بندها همچنان معتبر خواهند بود. عدم اعمال یک حق توسط سایا به معنای صرف‌نظر از آن حق نیست.',
    },
  ];
  return (
    <div className='relative h-[calc(100vh-60px)] md:h-full max-h-screen overflow-hidden w-full' style={{ userSelect: 'none' }}>
      <div className='absolute inset-0 -z-10 pointer-events-none bg-[#fcfcfe]'></div>

      <div className='absolute inset-0 -z-10 -top-[2%] -left-[70%] opacity-10'>
        <Image alt={''} src={`/api/images?folder=faq&file=curvy.svg`} width={100} height={100} className={'w-full h-full '} draggable={false} />
      </div>
      <div className='absolute inset-0 -z-10 '>
        <Image alt={''} src={`/api/images?folder=faq&file=gr.svg`} width={100} height={100} className={'w-screen h-screen floating-3d-f'} draggable={false} />
      </div>

      <div className='flex flex-col w-full items-center justify-center h-full z-20'>
        <div className='relative flex items-center justify-center h-screen'>
          <div className='absolute inset-0 -z-10 flex items-center justify-center blur-[3px] opacity-85'>
            <Image alt='' src='/api/images?folder=faq&file=terms.svg' className={'animate-pulse floating-3d opacity-75'} width={500} height={500} draggable={false} />
          </div>
          <div className='absolute inset-0 -z-10 flex items-center justify-center opacity-35 top-[380px]'>
            <Image alt={''} src={`/api/images?folder=faq&file=circle-bg.svg`} width={500} height={500} draggable={false} />
          </div>
          <h1 className='xs:text-4xl md:text-5xl lg:text-6xl font-bold text-gray-800 font-d7'>قوانین و مقررات</h1>
        </div>
        <div className='p-4 overflow-y-scroll scroll-hide bg-white rounded-2xl'>
          <div className='w-full xs:min-w-[80vw] xs:max-w-[90vw] md:min-w-[40vw] md:max-w-[50vw] lg:min-w-[30vw] lg:max-w-[40vw] mx-auto'>
            <p className='text-gray-700 leading-loose mb-6 text-justify' dir={'rtl'}>
              به پلتفرم سایا محصولی از زیست بوم ام‌رسالت خوش آمدید. این پلتفرم برای توانمندسازی کاربران جهت ایجاد، توزیع و تحلیل نظرسنجی‌ها، فرم‌ها، آزمون‌ها و سایر ابزارهای جمع‌آوری داده طراحی شده
              است. دسترسی به این پلتفرم از طریق نشانی
              <a href={process.env.NEXT_PUBLIC_MBZ_DOMAIN} className='text-blue-600 underline mx-1' target='_blank' dir={'rtl'} rel='noopener noreferrer'>
                {process.env.NEXT_PUBLIC_MBZ_DOMAIN}
              </a>
              یا سوپراپلیکیشن ام‌رسالت، به منزله موافقت شما با شرایط استفاده از سایا است. این شرایط، توافقی الزام‌آور بین کاربر و سایا است. لطفاً این شرایط را با دقت مطالعه کنید. در صورت عدم موافقت،
              نمی‌توانید از این پلتفرم استفاده نمایید.
            </p>
            <hr className='my-6 border-t border-gray-200' />

            {termsContent.map((item, index) => (
              <div key={index} className='mb-6'>
                <div className='flex items-center mb-3 border-r-4 border-blue-600 pr-3'>
                  <span className='ml-2 text-blue-600 font-bold'>{index + 1}.</span>
                  <h2 className='font-bold text-gray-800 text-base sm:text-lg lg:text-xl'>{item.title}</h2>
                </div>

                {/* محتوای پاراگراف */}
                <p className='font-medium text-gray-700 leading-loose text-justify whitespace-pre-line'>{item.content}</p>

                {/* جداکننده بین آیتم‌ها */}
                {index < termsContent.length - 1 && <hr className='my-6 border-t border-gray-200' />}
              </div>
            ))}
          </div>
        </div>
      </div>
    </div>
  );
}
